{
  "develop-using-fluidity-truffle-box": {
    "title": "Develop using Fluidity Truffle Box",
    "date": "2019-7-12",
    "author": "Deepa Sathaye, Guest Blogger from Fluidity",
    "published": true,
    "excerpt": "Fluidity has a pretty awesome truffle-box with lots of goodies to build secure, well-tested smart contracts. With two simple commands, you’ll be set up for development using these testing and security tools preconfigured."
  },
  "introducing-truffle-db-part-2": {
    "title": "Introducing Truffle DB, part 2: 'Weight and Switch'",
    "date": "2019-7-11",
    "author": "gnidan (Nick D'Andrea) and Faina Shalts",
    "published": true,
    "excerpt": "In the second of this two-part blog post, we go over Truffle DB's data model, interface, and our roadmap to release."
  },
  "introducing-truffle-db-part-1": {
    "title": "Introducing Truffle DB, Part 1: Artifact archeology",
    "date": "2019-7-10",
    "author": "gnidan (Nick D'Andrea)",
    "published": true,
    "excerpt": "In the first of this two-part blog post, learn about how Truffle manages to make sense of your project and some of the current limitations we hope to solve with our upcoming Truffle DB."
  },
  "the-blockchain-problem-that-ens-solves": {
    "title": "The Blockchain UI Problem that ENS Solves",
    "date": "2019-7-9",
    "author": "Brantly Millegan, guest blogger from Ethereum Name Service",
    "published": true,
    "excerpt": "The blockchain world has a UI problem. The computer-generated address system works great for computers but isn’t user-friendly. That’s where the Ethereum Name Service (ENS) comes in. ENS provides the same basic functionality of DNS (look up the records for “example.tld,” retrieve information), but replaces the hierarchical DNS server system with a few smart contracts on Ethereum."
  },
  "the-best-ways-to-contribute-to-truffle": {
    "title": "The Best Ways to Contribute to Truffle",
    "date": "2019-7-8",
    "author": "Tyler Feickert",
    "published": true,
    "excerpt": "Truffle is the amazing framework it is today because of developers like you. Find out how you can make Truffle even better!"
  },
  "10-things-we-dont-do-that-make-working-at-truffle-awesome": {
    "title": "10 Things We Don't Do That Make Working at Truffle Awesome",
    "date": "2019-7-5",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "At Truffle we have an extremely tight-knit team. You'll see that at this year's TruffleCon, a conference for hundreds of attendees organized by only a handful of people. We often have more work than we can handle, yet we take it on because we love the work we're doing and we love the people we work with."
  },
  "the-best-things-to-do-in-seattle-during-trufflecon": {
    "title": "The Best Things to do in Seattle During TruffleCon",
    "date": "2019-7-3",
    "author": "Liz Daldalian",
    "published": true,
    "excerpt": "TruffleCon 2019 is happening August 2-4, 2019 at Microsoft’s Redmond campus on the Eastside of Seattle. Five Trufflers call the Seattle area home and we compiled a list of our favorite things to do in the area!"
  },
  "ethereum-gas-exactimation": {
    "title": "Ethereum Gas Exactimation",
    "date": "2019-6-21",
    "author": "Nicholas Paterno & Cruz Molina",
    "published": true,
    "excerpt": "At Truffle, we decided such an approach was an unnecessarily CPU-intensive solution to the problem and set out to find a (theoretically) more performant and perfectly accurate way of estimating gas. The result? Gas exactimation."
  },
  "how-to-get-your-boss-to-send-you-to-trufflecon": {
    "title": "How to get your boss to send you to TruffleCon",
    "date": "2019-5-6",
    "author": "Liz Daldalian",
    "published": true,
    "excerpt": "Last year Truffle Suite launched TruffleCon, an event designed for the Truffle community and those interested in building world-changing applications powered by decentralized technologies. The event was received with an overwhelmingly positive response."
  },
  "truffle-v5-has-arrived": {
    "title": "Truffle v5 has arrived!",
    "date": "2018-12-18",
    "author": "Brittany Alexander",
    "published": true,
    "excerpt": "We have released the most awaited version of Truffle just in time for the holidays! There are SO many exciting things to mention that will make your Truffle experience a rich one."
  },
  "why-were-organizing-trufflecon-2018": {
    "title": "Why We're Organizing TruffleCon 2018",
    "date": "2018-07-16",
    "author": "Mike Pumphrey",
    "published": true,
    "excerpt": "As you have hopefully heard by now, TruffleCon, Truffle's first-ever user conference, will be on October 5-7, 2018 in Portland, Oregon, U.S.A."
  },
  "announcing-full-portable-solidity-debugger": {
    "title": "Announcing our Fully Featured, Portable Solidity Debugger",
    "date": "2018-2-26",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "Since Truffle's inception, it's been our mission to build outstanding development tools for the Ethereum community. The analogy we always used was one of history: Ethereum development practices are years behind the rest of the industry, and it's our job to build tools that modernize our craft. Well today, Truffle's come one step closer to that goal. We're happy to announce the release of our fully featured, fully portable Solidity debugger and debugging libraries."
  },
  "drizzle-reactive-ethereum-data-for-front-ends": {
    "title": "Drizzle: Reactive Ethereum Data for Front-ends",
    "date": "2018-2-20",
    "author": "Josh Quintal",
    "published": true,
    "excerpt": "Today we're proud to announce the addition of a new product to the Truffle Suite: Drizzle. Drizzle is a collection of front-end libraries that make writing dapp front-ends easier and more predictable.",
    "image": "/img/blog/thumbnails/drizzle-some-chaindata-on-your-ui.jpg"
  },
  "testrpc-is-now-ganache": {
    "title": "TestRPC is now Ganache",
    "date": "2017-12-26",
    "author": "Mike Pumphrey",
    "published": true,
    "excerpt": "Have you been looking for the TestRPC recently and haven't been able to find it? Don't worry, it's still here! It's just now known as Ganache. Ganache comes in two flavors: a fully-interactive development blockchain with a graphical interface, and the more familiar command-line version."
  },
  "first-ever-truffle-retreat": {
    "title": "Our First Ever Truffle Retreat",
    "date": "2017-11-29",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "We recently released Truffle 3.0 in February to much fanfare. As part of that release we separated our codebase into multiple different modules to make integrating with Truffle easier. Those modules now live in the github repository http://github.com/trufflesuite, which hints at our broader mission of providing a comprehensive suite of tools for Ethereum development.",
    "image": "/img/blog/thumbnails/first-ever-truffle-retreat.jpg"
  },
  "designing-the-ganache-logo": {
    "title": "Designing the Ganache Logo",
    "date": "2017-11-21",
    "author": "Josh Quintal",
    "published": true,
    "excerpt": "Last week we released Ganache, a personal blockchain for Ethereum development. Many of you commented on the design of the landing page and logo, but just how did the gooey cube come to be? Let's take a trip through the 30+ iterations that led to our newest confection.",
    "image": "/img/blog/thumbnails/designing-the-ganache-logo.jpg"
  },
  "one-hundred-documentation-pull-requests": {
    "title": "One hundred documentation pull requests? Yes please.",
    "date": "2017-10-23",
    "author": "Mike Pumphrey",
    "published": true,
    "excerpt": "Greetings! The Truffle team has been growing over the course of the last year. From a single developer, we are now a team of five (soon to be even more), which means that we can spread the work around. As a new full-time member of the team, I've first taken to looking at our existing materials to ensure that everything is up-to-date and working well. For example, our website, a public GitHub repository, had been receiving pull requests (PRs) for the better part of a year, and they had been languishing for want of someone to go through them.",
    "image": "/img/blog/thumbnails/one-hundred-documentation-pull-requests.jpg"
  },
  "you-can-now-make-your-own-truffle-box": {
    "title": "You Can Now Make Your Own Truffle Box",
    "date": "2017-9-26",
    "author": "Josh Quintal",
    "published": true,
    "excerpt": "Two months ago we unveiled official integration with Truffle Boxes, example Ethereum applications and/or boilerplates that put complimentary tools and libraries into sweet, easily-downloadable packages. In addition to rolling out some official boxes, Status.im released the first community-supported box. Today we're happy to announce anyone can now make their very own Truffle Box!"
  },
  "learn-ethereum-the-fun-way-with-our-pet-shop-tutorial": {
    "title": "Learn Ethereum The Fun Way with our Pet Shop Tutorial",
    "date": "2017-7-12",
    "author": "Josh Quintal",
    "published": true,
    "excerpt": "Here at Truffle we want to make Ethereum development accessible to developers of all stripes. To that end, today we're releasing a new tutorial called Pet Shop. It covers the entire local development process, start to finish. For added fun, we've tied the whole thing together within the narrative of creating a pet adoption dapp for a local pet shop owner.",
    "image": "/img/blog/thumbnails/learn-ethereum-the-fun-way-with-our-pet-shop-tutorial.jpg"
  },
  "truffle-boxes-making-life-sweeter": {
    "title": "Truffle Boxes: Making Life Sweeter",
    "date": "2017-7-6",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "When users begin developing on Ethereum, the first question they ask is, \"Where do I start?\". In the past, there hasn't been an easy answer: the answer generally consisted of many flavors of \"it depends\", and usually led to an investigation of what the user was trying to build, a general overview of their development skills, their knowledge of Ethereum, and the libraries and tools they're already most comfortable with. When determining how the Truffle team can help in this process, it quickly became apparent that what our users needed were examples. Many of them. So, being the upstanding community members we are, we set out to create those example, and today, we're happy to show you what we've accomplished."
  },
  "removing-installation-issues-continued-testrpc": {
    "title": "Removing installation issues, con't: TestRPC",
    "date": "2017-6-13",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "Update: Since this blog post was published, we have released Ganache a personal blockchain and a replacement to the TestRPC. We have left this post unaltered, but we highly recommend checking out our Working with Ganache page."
  },
  "how-were-making-installation-issues-a-thing-of-the-past": {
    "title": "How we're making installation issues a thing of the past",
    "date": "2017-6-5",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "Update: Since this blog post was published, we have released Ganache a personal blockchain and a replacement to the TestRPC. We have left this post unaltered, but we highly recommend checking out our Working with Ganache page."
  },
  "truffle-320-released": {
    "title": "Truffle 3.2.0 released 🎉",
    "date": "2017-3-22",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "Hi all. Great news today. Following your feedback from the Truffle 3.0 release, we've just released Truffle 3.2.0! This release includes a number of great new features and bug fixes, but we're most excited about the following. I've bolded the good stuff for ya."
  },
  "github-repository-moved": {
    "title": "We've moved our github repo!",
    "date": "2017-3-17",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "We recently released Truffle 3.0 in February to much fanfare. As part of that release we separated our codebase into multiple different modules to make integrating with Truffle easier. Those modules now live in the github repository http://github.com/trufflesuite, which hints at our broader mission of providing a comprehensive suite of tools for Ethereum development."
  }
}
