{
  "announcing-full-portable-solidity-debugger": {
    "title": "Announcing our Fully Featured, Portable Solidity Debugger",
    "date": "2018-02-26",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "Since Truffle's inception, it's been our mission to build outstanding development tools for the Ethereum community. The analogy we always used was one of history: Ethereum development practices are years behind the rest of the industry, and it's our job to build tools that modernize our craft. Well today, Truffle's come one step closer to that goal. We're happy to announce the release of our fully featured, fully portable Solidity debugger and debugging libraries."
  },
  "drizzle-reactive-ethereum-data-for-front-ends": {
    "title": "Drizzle: Reactive Ethereum Data for Front-ends",
    "date": "2018-02-20",
    "author": "Josh Quintal",
    "published": true,
    "excerpt": "Today we're proud to announce the addition of a new product to the Truffle Suite: Drizzle. Drizzle is a collection of front-end libraries that make writing dapp front-ends easier and more predictable.",
    "image": "/img/blog/drizzle-some-chaindata-on-your-ui/drizzle-modules.png"
  },
  "testrpc-is-now-ganache": {
    "title": "TestRPC is now Ganache",
    "date": "2017-12-26",
    "author": "Mike Pumphrey",
    "published": true,
    "excerpt": "Have you been looking for the TestRPC recently and haven't been able to find it? Don't worry, it's still here! It's just now known as Ganache. Ganache comes in two flavors: a fully-interactive development blockchain with a graphical interface, and the more familiar command-line version."
  },
  "first-ever-truffle-retreat": {
    "title": "Our First Ever Truffle Retreat",
    "date": "2017-11-29",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "We recently released Truffle 3.0 in February to much fanfare. As part of that release we separated our codebase into multiple different modules to make integrating with Truffle easier. Those modules now live in the github repository http://github.com/trufflesuite, which hints at our broader mission of providing a comprehensive suite of tools for Ethereum development.",
    "image": "/img/blog/first-ever-truffle-retreat/dock.jpg"
  },
  "designing-the-ganache-logo": {
    "title": "Designing the Ganache Logo",
    "date": "2017-11-21",
    "author": "Josh Quintal",
    "published": true,
    "excerpt": "Last week we released Ganache, a personal blockchain for Ethereum development. Many of you commented on the design of the landing page and logo, but just how did the gooey cube come to be? Let's take a trip through the 30+ iterations that led to our newest confection.",
    "image": "/img/blog/designing-the-ganache-logo/core-cutaways.png"
  },
  "one-hundred-documentation-pull-requests": {
    "title": "One hundred documentation pull requests? Yes please.",
    "date": "2017-10-23",
    "author": "Mike Pumphrey",
    "published": true,
    "excerpt": "Greetings! The Truffle team has been growing over the course of the last year. From a single developer, we are now a team of five (soon to be even more), which means that we can spread the work around. As a new full-time member of the team, I've first taken to looking at our existing materials to ensure that everything is up-to-date and working well. For example, our website, a public GitHub repository, had been receiving pull requests (PRs) for the better part of a year, and they had been languishing for want of someone to go through them.",
    "image": "/img/blog/one-hundred-documentation-pull-requests/take-a-stab.png"
  },
  "you-can-now-make-your-own-truffle-box": {
    "title": "You Can Now Make Your Own Truffle Box",
    "date": "2017-09-26",
    "author": "Josh Quintal",
    "published": true,
    "excerpt": "Two months ago we unveiled official integration with Truffle Boxes, example Ethereum applications and/or boilerplates that put complimentary tools and libraries into sweet, easily-downloadable packages. In addition to rolling out some official boxes, Status.im released the first community-supported box. Today we're happy to announce anyone can now make their very own Truffle Box!"
  },
  "learn-ethereum-the-fun-way-with-our-pet-shop-tutorial": {
    "title": "Learn Ethereum The Fun Way with our Pet Shop Tutorial",
    "date": "2017-07-12",
    "author": "Josh Quintal",
    "published": true,
    "excerpt": "Here at Truffle we want to make Ethereum development accessible to developers of all stripes. To that end, today we're releasing a new tutorial called Pet Shop. It covers the entire local development process, start to finish. For added fun, we've tied the whole thing together within the narrative of creating a pet adoption dapp for a local pet shop owner.",
    "image": "/img/blog/learn-ethereum-the-fun-way-with-our-pet-shop-tutorial/pet-shop-preview.jpeg"
  },
  "truffle-boxes-making-life-sweeter": {
    "title": "Truffle Boxes: Making Life Sweeter",
    "date": "2017-07-06",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "When users begin developing on Ethereum, the first question they ask is, \"Where do I start?\". In the past, there hasn't been an easy answer: the answer generally consisted of many flavors of \"it depends\", and usually led to an investigation of what the user was trying to build, a general overview of their development skills, their knowledge of Ethereum, and the libraries and tools they're already most comfortable with. When determining how the Truffle team can help in this process, it quickly became apparent that what our users needed were examples. Many of them. So, being the upstanding community members we are, we set out to create those example, and today, we're happy to show you what we've accomplished."
  },
  "removing-installation-issues-continued-testrpc": {
    "title": "Removing installation issues, con't: TestRPC",
    "date": "2017-06-13",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "Update: Since this blog post was published, we have released Ganache a personal blockchain and a replacement to the TestRPC. We have left this post unaltered, but we highly recommend checking out our Working with Ganache page."
  },
  "how-were-making-installation-issues-a-thing-of-the-past": {
    "title": "How we're making installation issues a thing of the past",
    "date": "2017-06-05",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "Update: Since this blog post was published, we have released Ganache a personal blockchain and a replacement to the TestRPC. We have left this post unaltered, but we highly recommend checking out our Working with Ganache page."
  },
  "truffle-320-released": {
    "title": "Truffle 3.2.0 released 🎉",
    "date": "2017-03-22",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "Hi all. Great news today. Following your feedback from the Truffle 3.0 release, we've just released Truffle 3.2.0! This release includes a number of great new features and bug fixes, but we're most excited about the following. I've bolded the good stuff for ya."
  },
  "github-repository-moved": {
    "title": "We've moved our github repo!",
    "date": "2017-03-17",
    "author": "Tim Coulter",
    "published": true,
    "excerpt": "We recently released Truffle 3.0 in February to much fanfare. As part of that release we separated our codebase into multiple different modules to make integrating with Truffle easier. Those modules now live in the github repository http://github.com/trufflesuite, which hints at our broader mission of providing a comprehensive suite of tools for Ethereum development."
  }
}