[
  {
    "title": "Building Blockchain Solutions for the Enterprise with Truffle",
    "start": "Tues, Mar 12, 2019, 4:00",
    "end": "4:45 PM GMT",
    "location": "Webinar",
    "excerpt": "Join Truffle's Ben Burns, Head of Blockchain Services, and Kevin Bluer, Head of Content & Training, in this complimentary webinar on building blockchain solutions for the enterprise. In the session, we'll explore the components of Truffle Suite itself, the range of enterprise services and integrations you can leverage, and how to train both yourself and your development teams on succeeding with this disruptive technology.",
    "eventbrite": "/events/webinar-enterprise-solutions",
    "status": "open",
    "image": "/img/truffle-webinar-1.jpeg"
  },
  {
    "title": "Rice Blockchain and Truffle: Build Your First Decentralized App",
    "start": "Thurs, Mar 21, 2019, 5:00",
    "end": "8:00 PM CST",
    "location": "Liu Idea Lab | Cambridge Building | Rice University | Houston | TX | United States",
    "excerpt": "Join Rice Blockchain and Truffle's Kevin Bluer for an evening building a decentralized application. We'll dive into all the core aspects of building a DApp: tooling, workflow, testing, debugging, and deployment. No prior experience with blockchain development is required.",
    "eventbrite": "http://bit.ly/dappworkshop",
    "status": "open",
    "image": "/img/rice-university.jpg"
  },
  {
    "title": "Truffle Elevate: Dublin",
    "start": "Wed, Apr 24, 2019, 9:00 AM",
    "end": "Fri, Apr 26, 2019, 5:00 PM IST",
    "location": "Science Gallery Dublin | The Naughton Institute, Trinity College Dublin | Pearse St, Dublin 2 | Ireland",
    "excerpt": "Truffle Elevate is our three-day blockchain development workshop and community event. Elevate is designed to upskill both traditional and blockchain developers plus help them learn how to use Truffle's Ethereum Blockchain Development suite better than ever before to build enterprise-level applications!",
    "eventbrite": "https://www.eventbrite.com/e/truffle-elevate-dublin-2019-tickets-53831596755",
    "status": "open",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F55021865%2F258066844538%2F1%2Foriginal.20190112-011100?w=800&auto=compress&rect=113%2C0%2C2444%2C1222&s=2a621f9ad4cabf7304c7e8b5a2c3eee5"
  }
]